# -*- coding: utf-8 -*-
#! /Users/michael/anaconda3/bin/python
# @Date:   2018-08-26 18:35:38

job_detail = '''职位描述：\n1.根据项目需求，进行项目设计和开发；\n2.完善并维护开发框架，解决框架在工程项目中反馈的缺陷；\n3.完成上级交办的其他工作任务。\n任职要求：\n1. 理工科专业，本科或以上学历；\n2.熟悉C++编程，有一年以上的相关编程经历，有项目开发经验的优秀应届毕业生也可酌情考虑；\n3.有软件项目开发经验优先；\n4.有分布式系统开发相关经验优先；\n5.有开源社区开发经验优先；\n6.项目初始阶段能适应996工作强度，并获得高薪收入；\n7.具备良好的逻辑思维、沟通、团队协作能力，有较强的责任心。\n员工福利：\n1.享受国家社保及国家法定节日假期；\n2.享受员工带薪年假福利；\n3.提供国际领先水平在职培训及指导（带薪）；\n4.提供住宿、三餐、办公室咖啡茶点、夜宵等生活福利。'
'主要职责\n岗位职责：\n1.设计和开发高性能,高可用,大并发的音视频服务和信令系统\n2.通过持续架构和质量优化,实现服务的高质量运营和高扩展性\n任职要求：\n1.本科及以上学历，2年及以上后台开发经验\n2.熟悉Linux操作系统原理, 良好的数据结构和算法能力\n3.精通C/C++/Golang至少一种开发语言，有良好的编程习惯；\n4.熟悉Unix/Linux开发环境，精通TCP/IP和网络开发\n5.良好的沟通能力和责任感，能够承担工作压力，独立分析和解决问题\n6.有大型运营系统设计和开发经验优先\n7.有大型互联网应用后台开发经验优先\n8.有大型互联网服务后台存储开发经验优先\n最低学历\n必须统招本科以上学历\n技能要求\n必须具备较强的C++；golang能力\n技能要求\n具备较强的c/c++；linux/unix；高并发；分布式；开发能力；golang能力优先\n其他项\n工作年限要求：资深3-5年、初级2年以上\n技能要求\n具备较强的c/c++；linux/unix；高并发；分布式；开发能力；golang能力优先\n其他项\n工作年限要求：资深3-5年、初级2年以上'
'岗位职责：\n1、\xa0负责组织策划品牌落地活动，形成圈层品牌曝光（各高端渠道）；\n2、\xa0负责开拓线下高端渠道异业合作，包括活动、产品入驻、品牌宣传等合作；\n3、\xa0对合作渠道进行深度运营，建立不同渠道的运营机制，并定期反馈运营数据；\n\xa0\n任职要求：\n1、全日制大专及以上学历，有过海外留学背景加分；\n2、在深圳本地有较强的高端渠道资源（线上/线下）；\n3、3年以上市场开拓、品牌活动经验；\n4：优秀的沟通能力、部门协调能力；'
'职位描述\n负责web项目后端的研发，架构设计，前沿技术研究等等\n任职要求\n计算机或相关专业\n精通HTTP，REST等\n精通一门以上web后端编程语言：Go, Python, Java, Node.js, Kotlin等\n熟悉大型web应用系统架构，数据库，缓存，消息队列等技术。\n技术控，热爱代码，对新兴技术有强烈兴趣\n有微服务，docker, kubernetes经验者优先\n有DevOps, 持续交付经验优先
职位诱惑：\n\xa0 1、能够熟悉券商的内部运作机制、风控模型，并进行创新；\n\xa0 2、公司快速成长中，大量新业务、系统改造进行中，锻炼机会多，上升空间大；\n\xa0 3、学习气氛好，有各种培训课程，有内部知识分享平台，技能在深度和广度上都能得到提高；\n\xa0 4、能学习到大量金融知识，接触到很多炒股高手，有助于投资理财能力的成长。\n\xa0 5、运动气氛好，公司有健身房、冲凉房，有不少运动达人。\n工作职责：\n\xa0 1、负责证券业务系统中各模块的日常开发和维护工作；\n\xa0 2、参与系统改造、重点项目、技术难点的攻坚。\n工作要求：\n\xa0 1、熟练掌握Python语言，熟练掌握常用语法糖、常用包；\n\xa0 2、熟悉linux开发环境，熟悉MySQL的使用方法；\n\xa0 3、具备基本的网络知识，具有扎实的数据结构和算法功底；\n\xa0 4、具备良好的分析解决问题能力、学习能力、团队协作能力，认真负责；\n\xa0 5、熟练掌握C++者优，有金融产品研发经验者优。'''

job_detail = '''1、本科或以上学历\n2、需具备3年以上Python开发经验，有大型分布式系统开发经验者优先；\n3、熟悉Python语言，熟练使用常用模块，使用过Django/Tornado等web框架；\n4、有过大数据相关经验，ELT处理经验优先\n5、具有良好的自学能力，能通过研究开源项目来解决开发中遇到的难题；\n6、熟悉以下技术者优先考虑，Hadoop, Spark, MongoDB, MySQL\n7、有前端（HTML、CSS、JavaScript、JQuery、Bootstrap）开发经验是加分项；\n8、熟悉腾讯云，熟悉Docker\n9、靠谱，有责任心'''
job_detail = '基于产品需求和用户使用场景，负责测试方案落地实现，参与系统搭建、调试等工作\n搭建算法相关自动化测试平台、参与数据处理等工具的开发和维护\n职位要求：\n熟悉Linux开发环境，了解C/C++开发语言\n精通python，ruby, node.js，php等至少一门脚本语言\n使用过mysql、MongoDB、sqlite等数据库\n较强的逻辑思维能力、分析问题的能力，善于并表达自己的想法\n强烈的责任心，有良好的沟通和团队意识\n具有以下经验优先：\n\xa0\xa0 1、web前端开发，了解一种以上开源web框架譬如flask、koa的架构\n\xa0 \xa02、持续集成、持续测试、持续部署、性能测试、自动化测试等工具的使用\n\xa0 \xa03、在校期间参加过ACM程序设计, 电子设计，数学建模等学科竞赛\n\xa0\xa0 4、linux嵌入式设备测试\n欢迎测试工程师转测试研发或python工程师岗位'
import re

skills = []
raw_skills = re.findall(r'[\x21-\x7f]+', job_detail)
for skill in raw_skills:
    skill = skill.strip(',')
    if re.match(r'\d+', skill):   # 纯数字不要
        continue
    if len(skill) <= 1:           # 只有一位的不要
        continue

    skill = skill.lower()         # 不分大小写
    split_skills = skill.split('/')
    if len(split_skills) > 1:
        skills.extend(split_skills)
    else:
        skills.append(skill)

print(skills)