# -*- coding: utf-8 -*-

text = '主要职责\n岗位职责：\n1.设计和开发高性能,高可用,大并发的音视频服务和信令系统\n2.通过持续架构和质量优化,实现服务的高质量运营和高扩展性\n任职要求：\n1.本科及以上学历，2年及以上后台开发经验\n2.熟悉Linux操作系统原理, 良好的数据结构和算法能力\n3.精通C/C++/Golang至少一种开发语言，有良好的编程习惯；\n4.熟悉Unix/Linux开发环境，精通TCP/IP和网络开发\n5.良好的沟通能力和责任感，能够承担工作压力，独立分析和解决问题\n6.有大型运营系统设计和开发经验优先\n7.有大型互联网应用后台开发经验优先\n8.有大型互联网服务后台存储开发经验优先\n最低学历\n必须统招本科以上学历\n技能要求\n必须具备较强的C++；golang能力\n技能要求\n具备较强的c/c++；linux/unix；高并发；分布式；开发能力；golang能力优先\n其他项\n工作年限要求：资深3-5年、初级2年以上\n技能要求\n具备较强的c/c++；linux/unix；高并发；分布式；开发能力；golang能力优先\n其他项\n工作年限要求：资深3-5年、初级2年以上'

print(text)